
let words = [
"бруда",
"висп",
"блудсикер",
"медуза",
"свен",
"магнус",
"сф",
"квопа",
"вивер",
"никс",
"лион",
"лина",
"акс",
"дестроер",
"трент",
"дизраптор",
"тимбер",
"клоквер",
"тайд",
"тини",
"пудж",
"бара",
"гуля",
"дум",
"абадон",
"алхимик",
"тускар",
"ликан",
"дк",
"баланар",
"антимаг",
"морф",
"бх",
"мирана",
"мипо",
"урса",
"троль",
"венга",
"нага",
"сларк"
];

let word = words[Math.floor(Math.random()*words.length)];

let array = [];
for (i=0; i<word.length; i++) {
   array[i] = "___";
}

let stopLoop = word.length;

while (stopLoop>0) {
   alert(array.join("   "));
   let guess = prompt("Привет. Меня зовут Иван и я хочу сыграть с тобой в игру. Угадай имя героя из доты 2 по буквам или нажми Отмена для выхода из игры. ");
   if (guess === null) {
      break;
   }
   else if (guess.length !== 1) {
      alert("Нужно вводить только одну букву на русском языке.");
   }
   else {
      for (j=0; j<word.length; j++) {
         if (word[j] === guess) {
            array[j] = guess;
            stopLoop--;
         }
      }
   }
}
alert(array.join("   "));
alert("Загаданное слово было " + word + "!");



